/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */

public class Main {   // class Solution - > class Main
    public static int number = 25;

    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.print(number*number);
    }
}
